//=============================================================================
//
// ボス練習モードヘッダー [BossPratice.h]
// Author：TH_GP11_GP11B341_35_頼凱興
//
//=============================================================================
#ifndef _BOSSPRATICE_H_
#define _BOSSPRATICE_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBossPratice(int InitState);
void UninitBossPratice(void);
void UpdateBossPratice(void);
void DrawBossPratice(void);
void DrawBossPraticeMenu(void);
bool GetExitPratice(void);

#endif
