//=============================================================================
//
// 前景ヘッダー [FrontBG.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _FRONTBG_H_
#define _FRONTBG_H_


//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define Texture_FrontBG				_T("data/Texture/BackGround/FrontBG.png")
#define Texture_FrontBG_Width		(2400)
#define Texture_FrontBG_Height		(768)



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitFrontBG(int InitState);
// 終了処理
void UninitFrontBG(void);
// 更新処理
void UpdateFrontBG(void);
// 描画処理
void DrawFrontBG(void);


#endif
