//=============================================================================
//
// リザルトヘッダー [Result.h]
// Author：HAL東京　ゲーム学科1年生　頼凱興 
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define Texture_ResultBG				_T("data/Texture/Player/ResultBG.png")
#define Texture_ResultBG_Width			(1024)
#define Texture_ResultBG_Height			(768)


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
// 初期化処理
HRESULT InitResult(int InitState);
// 終了処理
void UninitResult(void);
// 更新処理
void UpdateResult(void);
// 描画処理
void DrawResult(void);

#endif
