//=============================================================================
//
// リザルトヘッダー [Result.h]
// Author：TH_GP11_GP11B341_35_頼凱興
//
//=============================================================================
#ifndef _RESULT_H_
#define _RESULT_H_

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define Texture_ResultBG				_T("data/Texture/Player/ResultBG.png")
#define Texture_ResultBG_Width			(1024)
#define Texture_ResultBG_Height			(768)



//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitResult(int InitState);
void UninitResult(void);
void UpdateResult(void);
void DrawResult(void);

#endif
